src/DataProcessors/рмкКоннектор/рмкКоннектор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рмкКоннектор</name>
</mdclass:DataProcessor>

src/Catalogs/рмкИсходящиеСообщения/рмкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкИсходящиеСообщения</name>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>EnumRef.рмкСтатусыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПодключения</name>
    <type>
      <types>CatalogRef.рмкТочкиПодключения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДанных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аргументы</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <types>Date</types>
        <types>Boolean</types>
        <types>String</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/рмкКоннектор/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Компонента;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Инициализировать() Экспорт
	
	ВерсияКомпоненты = рмкОбщегоНазначенияПовтИсп.ПолучитьВерсиюКомпонентыRQM();
	
	Если ПустаяСтрока(ВерсияКомпоненты) Тогда
		ВызватьИсключение "В общих настройках RMQ Connector не указана используемая версия компоненты!";
	КонецЕсли;		
	
    ПодключениеВКУспешно = ПодключитьВнешнююКомпоненту("ОбщийМакет." + ВерсияКомпоненты, "BITERP", ТипВнешнейКомпоненты.Native);
    
    Если Не ПодключениеВКУспешно Тогда
    	ВызватьИсключение "Не удалось подключить внешнюю компоненту PinkRabbitMQ";
    КонецЕсли;	
    
    Компонента = Новый("AddIn.BITERP.PinkRabbitMQ3"); 
   	
КонецПроцедуры

Процедура Закрыть() Экспорт
	
	Компонента = Неопределено;
	
КонецПроцедуры

Процедура Подключиться(ВиртуальныйХост) Экспорт
	
	ПараметрыВиртуальногоХоста = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъекта(ВиртуальныйХост, "Владелец,Наименование");
	ПараметрыСервера = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъекта(ПараметрыВиртуальногоХоста.Владелец, "Адрес,Порт,ИмяПользователя,Пароль");
	
	ПроверитьЗаполненностьПараметра(ПараметрыСервера.Адрес, 			"Адрес сервера");
	ПроверитьЗаполненностьПараметра(ПараметрыВиртуальногоХоста.Наименование, "Имя виртуального хоста");
	ПроверитьЗаполненностьПараметра(ПараметрыСервера.Порт, 				"Порт сервера");
	ПроверитьЗаполненностьПараметра(ПараметрыСервера.ИмяПользователя, 	"Имя пользователя подключения");
	ПроверитьЗаполненностьПараметра(ПараметрыСервера.Пароль, 			"Пароль пользователя подключения");
	
	Попытка
		Компонента.Connect(ПараметрыСервера.Адрес, ПараметрыСервера.Порт, ПараметрыСервера.ИмяПользователя, ПараметрыСервера.Пароль, ПараметрыВиртуальногоХоста.Наименование);
	Исключение
		
		ВызватьИсключение "Не удалось подключиться к серверу. 
							|Проверьте настройки подключения или доступность сервера";
		
	КонецПопытки;		
	
КонецПроцедуры

Процедура ОтправитьСообщение(Сообщение) Экспорт
	
	ИмяТочки = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение.ТочкаПодключения, "ИмяТочки");
	СодержимоеСообщения = Сообщение.Данные.Получить();
	СтрокаАргументов = ПолучитьАргументыСообщенияВJSON(Сообщение);
	
	Попытка
	
		Компонента.BasicPublish(ИмяТочки, "", СодержимоеСообщения, 0, Ложь, СтрокаАргументов);
		рмкОбработкаСообщений.ЗафиксироватьСтатусСообщения(Сообщение.Ссылка, "Отправлено");
		
	Исключение
		
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		рмкОбработкаСообщений.ЗафиксироватьСтатусСообщения(Сообщение, "Ошибка", ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(рмкОбщегоНазначения.ПрефиксСобытияЖурналаРегистрации() + "Отправка сообщения", 
										УровеньЖурналаРегистрации.Ошибка, , ИмяТочки, ПодробноеПредставлениеОшибки);
		
	КонецПопытки	
	
КонецПроцедуры	

Процедура ПолучитьСообщенияИзОчереди(СлушательОчереди) Экспорт
	
	ПрочитанноеСообщение = "";
    ТегСообщения = 0;
	
	Попытка
		
		ИмяОчереди = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(СлушательОчереди, "ИмяОчереди");
        Компонента.BasicConsume(ИмяОчереди, "", Ложь, Ложь, 100);
        
        Пока Компонента.BasicConsumeMessage("", ПрочитанноеСообщение, ТегСообщения, 5000) Цикл
           
           	рмкОбработкаСообщений.СоздатьВходящееСообщение(СлушательОчереди, ПрочитанноеСообщение);
           
            // TODO сделать подтверждение только в случае успешного принятия сообщения
            Компонента.BasicAck(ТегСообщения);
            ПрочитанноеСообщение = ""; 			// Обнуляем, чтобы избежать утечку памяти
            ТегСообщения = 0; 					// Обнуляем, чтобы избежать утечку памяти
            
        КонецЦикла;
        
        Компонента.BasicCancel("");
        
    Исключение
       
        ОписаниеОшибки = Компонента.GetLastError();
		ЗаписьЖурналаРегистрации(рмкОбщегоНазначения.ПрефиксСобытияЖурналаРегистрации() + "Ошибка получения сообщений", 
									УровеньЖурналаРегистрации.Ошибка, , СлушательОчереди, ОписаниеОшибки);
        
    КонецПопытки;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполненностьПараметра(ЗначениеПараметра, ИмяПараметра)
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") И ПустаяСтрока(ЗначениеПараметра)
		Или Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		
		ВызватьИсключение СтрШаблон("Не заполнено значения параметра ""%1"" при подключении к серверу RMQ!", ИмяПараметра);
		
	КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьАргументыСообщенияВJSON(Сообщение)
	
	СоставАргументов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	рмкИсходящиеСообщенияАргументы.Ключ,
	|	рмкИсходящиеСообщенияАргументы.Значение
	|ИЗ
	|	Справочник.рмкИсходящиеСообщения.Аргументы КАК рмкИсходящиеСообщенияАргументы
	|ГДЕ
	|	рмкИсходящиеСообщенияАргументы.Ссылка = &Сообщение";
	Запрос.УстановитьПараметр("Сообщение", Сообщение);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоставАргументов.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;
		
	Возврат рмкОбщегоНазначения.СериализоватьОбъект(СоставАргументов);	
	
КонецФункции	

#КонецОбласти

#КонецЕсли
